<?php

return [
    'subscription' => 'абонемент|Абонементы',
    'ptype' => 'тип|Типы программ',
    'foodprogram' => 'программу|Программы питания',
    'relaxprogram' => 'программу|Программы отдыха',
    'programtraining' => 'программу|Программы (тренировки)',
    'activeprogram' => 'программу|Активные программы',
    'exercise' => 'упражнение|Упражнения',
    'meal' => 'блюдо|Блюда',
    'eathour' => 'час приема|Часы приема',
    'planeat' => 'план|План питания',
    'training' => 'тренировку|Тренировки (программы-упражнения)',
    'equipment' => 'оборудование|Оборудование для тренировок',
    'grocery' => 'продукт|Продукты для тренировок',
    'relaxexercise' => 'упражнение|Упражнения',
    'relaxtraining' => 'тренировку|Тренировки (программы-упражнения)',
    'typepurchase' => 'тип|Типы покупок',
    'purchase' => 'покупку|Покупки',
    'userparameter' => 'параметр пользователя|Параметры пользователей',
    'listequip' => 'оборудование|Список оборудования',
];
