<?php

return [
    'subscription' => 'абонемент|Абонементы',
    'ptype' => 'тип|Типы программ',
    'foodprogram' => 'программу|Программы питания',
    'relaxprogram' => 'программу|Программы отдыха',
    'programtraining' => 'программу|Программы (тренировки)',
    'activeprogram' => 'программу|Активные программы',
    'exercise' => 'упражнение|Упражнения',
    'meal' => 'блюдо|Блюда',
    'eathour' => 'час приема|Часы приема',
    'planeat' => 'план|План питания',
    'training' => 'тренировку|Тренировки (программы-упражнения)',
    'equipment' => 'оборудование|Оборудование для тренировок',
    'grocery' => 'продукт|Продукты для тренировок',
    'relaxexercise' => 'упражнение|Упражнения',
    'relaxtraining' => 'тренировку|Тренировки (программы-упражнения)',
    'typepurchase' => 'тип|Типы покупок',
    'purchase' => 'покупку|Покупки',
    'userparameter' => 'параметр пользователя|Параметры пользователей',
    'listequip' => 'оборудование|Список оборудования',
    'password_reset' => [
        'subject' => 'Восстановление пароля от админки',
        'greeting' => 'Добрый день, спасибо что пользуетесь нашей системой',
    ],
    'listmeal' => 'продукт|Список продуктов',
    'validation' => [
        'min' => [
            'string' => 'Пароль должен быть минимум 6 символов',
        ],
        'same' => 'Пароли не совпадают',
        'confirmed' => 'Введенные данные не совпадают',
    ],
    'auth' => [
        'failed' => 'Неверные данные',
    ],
    'passwords' => [
        'sent' => 'Ссылка на восстановление пароля отправлена на ваш email',
    ],

    'change_program' => 'Вы действительно хотите выбрать данную программу?',
    'change_subscription' => 'Вы действительно хотите выбрать данный абонемент?',
    'on' => 'Активно',
    'off' => 'Не активно',
];
